app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def update
    @user = User.find(params[:id])