app/controllers/users_controller.rb

SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"
---
  def index
    @users = User.paginate(:page => params[:page])

INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "admin", "mobile_pin", "phone", "remember_token", "email") VALUES('Deeps', '7f8cf386a3c86cb0f4f864f796ffe301e515df30c8ef914e7bec09b0ad3b2903', '656e557e7dcf7035bcf8c8df6f826285f0cb089a4d68c8ab3bf9d9d958736878', '2010-08-21 06:15:58', '2010-08-21 06:15:58', 'f', '1111', '6138184430', NULL, 'dcdutt@intsyx.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE "users" SET "phone" = '6132241479', "updated_at" = '2010-07-15 16:02:37', "encrypted_password" = '0da0dded636d4bd5db2c9c5ecf0311f9efad04466ca4a80449b105f57432d3b6', "salt" = '4b2941f1dee429ac542a1d46a66b8eb572780006d46636625f6b70b0bc18a5c2' WHERE "id" = 1
---
  def update

    respond_to do |format|
      if @user.update_attributes(params[:user])